tap "oven-sh/bun"
brew "openssl@3"
brew "awscli"
brew "coreutils"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "libuv"
brew "node"
brew "gemini-cli"
brew "go"
brew "golangci-lint"
brew "jq"
brew "lf"
brew "neovim"
brew "pass"
brew "pass-otp"
brew "pgcli"
brew "postgresql@17"
brew "redis"
brew "ripgrep"
brew "rust"
brew "telnet"
brew "tmux"
brew "wrk"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "appcleaner"
cask "discord"
cask "font-iosevka-nerd-font"
cask "ghostty"
cask "iina"
cask "keyboardcleantool"
cask "mos"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
