tap "hashicorp/tap"
tap "netbirdio/tap"
tap "oven-sh/bun"
brew "atlas"
brew "openssl@3"
brew "python@3.13"
brew "awscli"
brew "btop"
brew "cloc"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "delve"
brew "eza"
brew "fastfetch"
brew "fd"
brew "foundry"
brew "fzf"
brew "gcc"
brew "libuv"
brew "node"
brew "gemini-cli"
brew "ghz"
brew "git-delta"
brew "glow"
brew "go"
brew "goimports"
brew "golangci-lint"
brew "gopls"
brew "graphviz"
brew "grpcurl"
brew "helm"
brew "jq"
brew "k3d"
brew "k6"
brew "localstack"
brew "ncurses"
brew "tree-sitter"
brew "neovim"
brew "nping"
brew "nushell"
brew "pass"
brew "pass-otp"
brew "pgcli"
brew "postgresql@17"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "redis"
brew "rust"
brew "rust-analyzer"
brew "telnet"
brew "temporal"
brew "terraform"
brew "tmux"
brew "wget"
brew "wrk"
brew "zig"
brew "zls"
brew "hashicorp/tap/vault"
brew "oven-sh/bun/bun"
cask "appcleaner"
cask "cursor"
cask "discord"
cask "font-iosevka-nerd-font"
cask "ghostty"
cask "iina"
cask "keyboardcleantool"
cask "mos"
cask "netbird-ui"
cask "obsidian"
cask "openvpn-connect"
cask "orbstack"
cask "postman"
cask "qbittorrent"
cask "raycast"
